Revit 2027 API
ConduitSettings.GetConduitSettings Method
 Gets the conduit settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ConduitSettings GetConduitSettings(
	Document document
)
Public Shared Function GetConduitSettings (
	document As Document
) As ConduitSettings
public:
static ConduitSettings^ GetConduitSettings(
	Document^ document
)
static member GetConduitSettings :
        document : Document -> ConduitSettings
Parameters
document Document
 The document.
Return Value
ConduitSettings
 The conduit settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace